Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: no, meeting him back then could have just been a coincidence or a hallucination.
es_419: NO, LO DE LA VEZ PASADA PODRÍA HABER SIDO UNA COINCIDENCIA O UNA ALUCINACIÓN.

source: ...she’s the only person I have left.
es_419: … NO TENGO A NADIE MÁS.

source: I’m going to school.
es_419: YA ME VOY A LA ESCUELA.

source: yeah, haha. everything she does is a copy of juhyeon.
es_419: SÍ. JA, JA. TODO LO QUE HACE ES PARA COPIAR A JUHYEON.

source: I’m meeting my boyfriend.
es_419: VERÉ A MI NOVIO.

source: hey, jeongmin!
es_419: ¡HOLA, JEONGMIN!

source: people treat you like this because you’re so creepy.
es_419: LA GENTE TE TRATA ASÍ PORQUE ERES ASQUEROSA.

source: I’m home...
es_419: YA LLEGUÉ...

source: but still...
es_419: PERO…

source: I have something to tell you...
es_419: TENGO ALGO QUE CONTARTE…

source: sob
es_419: LLORA

source: really!
es_419: ¡EN SERIO!

source: hey! where were you?!
es_419: ¡OIGAN! ¡¿DÓNDE ESTABAN?!

source: please just give me some reassurance, jaehyeok...
es_419: DAME ALGUNA SEÑAL DE SEGURIDAD, JAEHYEOK…

source: birds of a feather...
es_419: SON DOS GOTAS DE AGUA…

source: apparently, she bullied juhyeon in grade school.
es_419: DICEN QUE LE HIZO BULLYING A JUHYEON EN PRIMARIA.

source: I have so much more I want to talk to you about.
es_419: ME GUSTARÍA HABLARTE DE MUCHAS OTRAS COSAS.

source: ...I was more worried about you than jeongmin.
es_419: ME PREOCUPÉ MÁS POR TI QUE POR JEONGMIN.

source: ...and it was common for boys in other classes to ask her out.
es_419: … Y NO ERA RARO QUE LA INVITARAN A SALIR CHICOS DE OTROS SALONES.

source: but I ignored it.
es_419: PERO LO IGNORÉ.

source: oh, hi.
es_419: AH, HOLA.

source: I’ll sing you a great song--
es_419: TE CANTARÉ ALGO GENIAL…

source: my friends and I are going to buy lunch later :( how’s yours?
es_419: MIS AMIGOS Y YO IREMOS A COMPRAR ALMUERZO LUEGO :( ¿QUÉ TAL EL TUYO?

source: are you okay with hanging out with me?
es_419: ¿TE AGRADA PASAR TIEMPO CONMIGO?

source: it’s like I’m the only one that juhyeon has in her clutches...
es_419: ES COMO SI FUERA LA ÚNICA A QUIEN JUHYEON CONTROLA ASÍ…

source: she would have told me already.
es_419: SEGURO ME LO HABRÍA DICHO.

source: sorry, it’s nothing.
es_419: NO ES NADA.

source: oh, I know!!
es_419: ¡YA ME ACUERDO!

source: honestly, I bet she’d leave me to be one of juhyeon’s cronies if she had the chance.
es_419: SI PUDIERA, SEGURO ME DEJARÍA DE LADO PARA SER UNA LACAYA DE JUHYEON.

source: are you going home now?
es_419: ¿SE VAN A CASA?

source: I don’t understand people like that.
es_419: NO COMPRENDO A ESA GENTE.

source: just because we’ve been friends since grade school, she always looks down on me and tries to teach me lessons!
es_419: ¡SIEMPRE ME MENOSPRECIA Y QUIERE DARME LECCIONES! ¡Y SOLO PORQUE SOMOS AMIGAS DESDE LA PRIMARIA!

source: do you want to hang out with me?
es_419: ¿QUIERES PASAR TIEMPO CONMIGO?

source: I was fooled by her appearance at first too...
es_419: YO TAMBIÉN ME DEJÉ ENGAÑAR POR SU APARIENCIA…

source: yeah, what is it?
es_419: ¿QUÉ PASA?

source: the homeroom teacher wanted you to go to the teachers’ office since you’re the class president...
es_419: COMO ERES LA PRESIDENTA DE LA CLASE, EL PROFESOR QUIERE QUE VAYAS A LA SALA DE MAESTROS…

source: a saint? as if!
es_419: ¿UNA SANTA? SÍ, CLARO…

source: what’s happening?
es_419: ¿QUÉ SUCEDE?

source: aw, okay.
es_419: AH, ESTÁ BIEN.

source: haha, it’s fine.
es_419: JA, JA. NO ES NECESARIO.

source: you can just think of it like that.
es_419: PUEDES PENSARLO DE ESA FORMA.

source: it was a man...
es_419: ERA UN HOMBRE…

source: it’s not like I did a good thing.
es_419: NO HICE ALGO BUENO…

source: did I give you permission to show jeongmin that picture?
es_419: ¿ACASO TE DI PERMISO PARA MOSTRARLE ESA FOTO A JEONGMIN?

source: I’m sure I set my account to private so only I could see it...
es_419: ESTOY SEGURA DE QUE MI CUENTA ES PRIVADA; SOLO YO TENDRÍA QUE PODER VERLA…

source: we’re not friends!!
es_419: ¡NO SOMOS AMIGAS!

source: um... jeongmin,
es_419: EH… ¡JEONGMIN!

source: that’s...
es_419: ES…

source: no, it’s not like that...
es_419: NO, PARA NADA…

source: I know a place where there are no people.
es_419: CONOZCO UN LUGAR EN DONDE NO HAY NADIE.

source: well, I thought as much.
es_419: BUENO, ESO ME IMAGINÉ.

source: should we all hang out somewhere to celebrate becoming friends?
es_419: ¿SALIMOS A CELEBRAR QUE AHORA TODAS SOMOS AMIGAS?

source: why is it juhyeon?!
es_419: ¡¿POR QUÉ JUHYEON?!

source: bye, jeongmin! see you next week!
es_419: ¡ADIÓS, JEONGMIN! ¡HASTA LA SEMANA QUE VIENE!

source: juhyeon ha is the one who turned me into an outcast...
es_419: JUHYEON HA FUE LA QUE ME AISLÓ DE TODO EL MUNDO…

source: pass
es_419: ENTREGA

source: it’s strange, isn’t it?
es_419: ES CURIOSO, ¿NO LO CREES?

source: she said she doesn’t have time to wait for you to come back from the bathroom.
es_419: DIJO QUE NO PUEDE ESPERAR A QUE VUELVAS DEL BAÑO…

source: you bitch.
es_419: HIJA DE PUTA.

source: there are two major ways to successfully lucid dream.
es_419: HAY DOS FORMAS BÁSICAS DE TENER SUEÑOS LÚCIDOS.

source: tell me if this makes you uncomfortable, but...
es_419: DIME SI TE SIENTES INCÓMODA, PERO…

source: ...you should have been nicer to me...
es_419: … TENDRÍAS QUE HABER SIDO MÁS AMABLE CONMIGO.

source: ok if you die, we’ll report jeongmin
es_419: SI TE MATA, LA DENUNCIAMOS

source: her mom and dad broke up.
es_419: SU MAMÁ Y SU PAPÁ SE SEPARARON.

source: clear
es_419: CON CLARIDAD

source: I don’t know.
es_419: NO LO SÉ.

source: oh, juhyeon.
es_419: AY, JUHYEON.

source: I’ll treat you today!
es_419: ¡HOY INVITO YO!

source: m-make them disappear?
es_419: EH… ¿HACERLOS DESAPARECER?

source: hey, my wound is gonna open up again!
es_419: ¡SE ME VOLVERÁ A ABRIR LA HERIDA!

source: I’m so curious...
es_419: QUIERO SABER QUÉ PASÓ…

source: attention!
es_419: ¡ATENCIÓN!

source: after I gained a friend group...
es_419: DESDE QUE TENGO UN GRUPO DE AMIGAS,

source: jeongmin... did youtell your friends that...?
es_419: JEONGMIN… ¿LES DIJISTE ESO A TUS AMIGAS…?

source: the second is to fall asleep with the intent to lucid dream and quickly enter a lucid dream.
es_419: LA SEGUNDA ES DORMIRSE CON LA INTENCIÓN DE TENER UN SUEÑO LÚCIDO PARA COMENZARLO ENSEGUIDA.

source: there’s your phone.
es_419: AHÍ ESTÁ TU CELULAR.

source: you don’t have the opportunity to talk like this in front of anyone else, do you?
es_419: NO PUEDES HABLAR ASÍ CON NADIE MÁS, ¿CIERTO?

source: school is still like hell...
es_419: LA ESCUELA SIGUE SIENDO UN INFIERNO…

source: so I always want to hear stories about the outside world, even if other people might find them boring.
es_419: POR ESO ME GUSTA OÍR HISTORIAS DEL MUNDO EXTERIOR; INCLUSO SI SON ABURRIDAS PARA LOS DEMÁS.

source: drip
es_419: PLIC

source: where’s yuju...
es_419: ¿DÓNDE ESTÁ YUJU…?

source: what’s going on here...?
es_419: ¿QUÉ SUCEDE?

source: I should back up the pictures too, just in case.
es_419: DEBERÍA GUARDAR UNA COPIA, POR LAS DUDAS.

source: ...but it’s hard to see my classmates’ faces in detail.
es_419: … PERO ME CUESTA MUCHO VER LAS CARAS DE MIS COMPAÑERAS.

source: I heard that you just made her an outcast.
es_419: ESCUCHÉ QUE LA AISLASTE.

source: I’m not going.
es_419: NO IRÉ.

source: you bitch...
es_419: DESGRACIADA…

source: you just want a reason to torment me.
es_419: SOLO QUIERES UN MOTIVO PARA ATORMENTARME.

source: xxxxx xxth
es_419: XXXXX XX

source: why are you suddenly clinging onto jeongmin?
es_419: ¿POR QUÉ AHORA ESTÁS TAN PEGADA A JEONGMIN?

source: the sora choi I’ve seen...
es_419: A LA SORA CHOI QUE VI…

source: why are you giving her a hard time about that?!
es_419: ¡¿POR QUÉ TE ENOJAS CON ELLA POR ALGO ASÍ?!

source: "what did you say for juhyeon to--"
es_419: "¿QUÉ LE DIJISTE PARA QUE JUHYEON…?"

source: hyejin, take a desk and sit back there.
es_419: HYEJIN, TOMA UN PUPITRE Y SIÉNTATE ALLÍ ATRÁS.

source: I’m sure they didn’t mean anything else when they said that.
es_419: ESTOY SEGURA DE QUE NO OCULTABAN NADA CUANDO LO DIJERON.

source: "can I say hi if I run into you again?"
es_419: "¿PUEDO SALUDARTE SI NOS VOLVEMOS A VER?".

source: okay... bye...
es_419: ESTÁ BIEN… ADIÓS…

source: it might not be a huge deal,
es_419: TAL VEZ NO SEA MUCHO,

source: is something wrong with you? can you not talk without sora choi?
es_419: ¿TE PASA ALGO? ¿NO PUEDES HABLAR SIN AYUDA DE SORA?

source: yeah, I heard it’s super good.
es_419: SÍ, ME DIJERON QUE ES RIQUÍSIMO.

source: he talked a lot about that cartoon again.
es_419: OTRA VEZ HABLÓ MUCHO SOBRE ESA CARICATURA.

source: got it? let's go to the snack shop now.
es_419: ¿LISTO? VAMOS A COMPRAR ALGO DE COMER.

source: those guys have to read it for themselves.
es_419: ELLOS TAMBIÉN TENDRÍAN QUE LEERLOS.

source: isn’t that unbelievable...?
es_419: ¿NO TE PARECE UNA LOCURA…?

source: this is amazing...!
es_419: ¡INCREÍBLE…!

source: get real.
es_419: NO DIGAS TONTERÍAS.

source: it’s really unfair...!
es_419: ¡NO ES JUSTO…!

source: that sounds fun.
es_419: SUENA INTERESANTE.

source: most of the boys in our class seemed to like her...
es_419: LE GUSTABA A LA MAYORÍA DE LOS CHICOS…

source: I can’t today!
es_419: ¡HOY NO PUEDO!

source: you might be able to do that...
es_419: QUIZÁS TÚ PUEDAS HACERLO…

source: beyond that...
es_419: PRIMERO QUE NADA…

source: all of a sudden?
es_419: QUÉ REPENTINO…

source: were you hurt really badly?
es_419: ¿TE LASTIMASTE MUCHO?

source: whatever. let’s not hang out with each other anymore.
es_419: NO IMPORTA. DEJEMOS DE JUNTARNOS Y YA.

source: but what if I don’t believe them?
es_419: ¿QUÉ PASA SI NO LES CREO?

source: I just started my time of the month.
es_419: ESTOY EN ESOS DÍAS…

source: when has she ever gotten angry?!
es_419: ¡¿CUÁNDO LA VISTE ENOJADA?!

source: being stuck in a white space like this for a long time...
es_419: QUEDAR ATRAPADO EN UN ESPACIO EN BLANCO ASÍ DURANTE MUCHO TIEMPO…

source: those bitches have nothing better to do...
es_419: ESAS PERRAS NO TIENEN NADA MEJOR QUE HACER…

source: you bitch, how can you be asleep when your husband comes home, huh?!
es_419: ¡PERRA! ¡¿CÓMO TE ATREVES A ESTAR DORMIDA CUANDO LLEGA TU MARIDO?!

source: whatever, we don’t have much time. let’s go to the snack shop.
es_419: NO TE PREOCUPES; DE TODOS MODOS, NO TENEMOS TIEMPO. VAMOS A COMPRAR.

source: I tried to stop you two from the very beginning.
es_419: INTENTÉ DETENERLAS DESDE EL PRINCIPIO.

source: I’m still alone...
es_419: SIGO ESTANDO SOLA…

source: according to her mother...
es_419: SEGÚN LO QUE DIJO SU MADRE…

source: I was happy that you had a lot of people around you now, unlike in grade school.
es_419: ME PUSO CONTENTA VER A TANTA GENTE A TU ALREDEDOR; TODO LO CONTRARIO A LA PRIMARIA.

source: freeze
es_419: SORPRENDIDA

source: oh yeah! we get to go home!
es_419: ¡ES VERDAD! ¡PODEMOS VOLVER A CASA!

source: "sounds fun."
es_419: "SUENA DIVERTIDO".

source: you never know.
es_419: NUNCA SE SABE.

source: I’ve been getting rest instead of lucid dreaming these last few days...
es_419: EN LUGAR DE TENER SUEÑOS LÚCIDOS, HACE DÍAS QUE DESCANSO POR LAS NOCHES…

source: I told you to leave her alone.
es_419: LES DIJE QUE LA DEJARAN EN PAZ.

source: where are they going?
es_419: ¿A DÓNDE VAN?

source: sorry, jaehyeok. that must have shocked you.
es_419: PERDÓN, JAEHYEOK. SEGURO QUE ESO TE SORPRENDIÓ.

source: ...are nobodies in my dreams.
es_419: … NO SON NADA EN MIS SUEÑOS.

source: she said something to you too, didn’t she?
es_419: TAMBIÉN TE DIJO ALGO A TI, ¿VERDAD?

source: ...enjoys nitpicking others’ actions and talking about them behind their backs.
es_419: … LE GUSTA MANIPULAR A OTROS Y HABLAR DE ELLOS A SUS ESPALDAS.

source: ...you don’t know what to do?
es_419: PARECE QUE NO SABES QUÉ HACER.

source: it seems like you really don’t know who I am...
es_419: PARECE QUE REALMENTE NO SABES QUIÉN SOY.

source: Dictionary
es_419: DICCIONARIO

source: just do it, juhyeon!
es_419: ¡HAZLO, JUHYEON!

source: do I have to come and go whenever you tell me to?
es_419: ¿TENGO QUE HACER TODO LO QUE ME PIDES?

source: ...and this is how you repay her?
es_419: ¿Y ASÍ LE PAGAS?

source: after that, juhyeon and I quickly became friends.
es_419: DESPUÉS DE ESO, JUHYEON Y YO NOS HICIMOS AMIGAS.

source: every time all of us were having fun, you’d always get upset and start lecturing us.
es_419: SIEMPRE QUE NOS DIVERTÍAMOS, TÚ TE ENOJABAS Y EMPEZABAS A SERMONEARNOS.

source: see what?
es_419: ¿QUÉ COSA?

source: drink something more expensive!
es_419: ¡PÍDETE ALGO MÁS CARO!

source: but I’m sure dasom will tell me if they actually do break up.
es_419: SI CORTAN, DASOM ME LO DIRÁ. ESTOY SEGURA.

source: just hear me out.
es_419: ESCÚCHAME.

source: were you waiting long?
es_419: ¿ESPERASTE MUCHO?

source: you get in the way a lot for someone so short.
es_419: PARA SER ALGUIEN TAN BAJITA, ESTÁS MUCHO EN EL MEDIO.

source: ...I’m just a piece of trash that no one acknowledges.
es_419: … SOY UN PEDAZO DE BASURA QUE TODOS IGNORAN.

source: and you’re still going to pretend it’s not you?
es_419: ¿SIGUES DICIENDO QUE NO ERES TÚ?

source: I left something in the classroom too, so...
es_419: YO TAMBIÉN ME OLVIDÉ ALGO EN EL SALÓN…

source: honestly, I didn’t feel great sending you away like that last time.
es_419: PARA SERTE FRANCO, NO ME SENTÍ BIEN DESPUÉS DE LA ÚLTIMA VEZ.

source: there was actually something I wanted to ask for your help with...
es_419: PRIMERO QUERÍA PEDIRTE AYUDA CON UNA COSA.

source: you were the only person I confided that to,
es_419: ERAS LA ÚNICA A QUIEN SE LO HABÍA CONTADO.

source: am I your little sidekick?
es_419: ¿SOY TU SECUAZ O ALGO ASÍ?

source: because she was talking a lot of shit about me, haha.
es_419: ESTABA HABLANDO MUY MAL DE MÍ. JA, JA.

source: I just want to die these days, I’m so tired. please tell me how I can deal with bullying
es_419: ÚLTIMAMENTE SOLO QUIERO MORIRME Y ESTOY MUY CANSADA. DÍGANME CÓMO DEFENDERME DEL BULLYING

source: fine.
es_419: BIEN.

source: he kept chasing me around, so I just...
es_419: NO DEJABA DE SEGUIRME, ASÍ QUE…

source: oh, this bitch must have lost her damn marbles,
es_419: ESTA PERRA DEBE HABER PERDIDO UN TORNILLO.

source: it’s not like I couldn’t understand where you were coming from.
es_419: ENTIENDO BIEN POR QUÉ DIJISTE TODO ESO.

source: ...but she fell for it right away, hahaha.
es_419: … Y CAYÓ EN LA TRAMPA ENSEGUIDA. JA, JA, JA.

source: ...how would that make me look,
es_419: ME HACES QUEDAR MAL,

source: blurry
es_419: BORROSO

source: who’s number 30?
es_419: ¿QUIÉN ES EL 30?

source: get ready go to home.
es_419: GUARDEN TODO PARA IR A CASA.

source: did she not wash up today either? look at her hair.
es_419: ¿OTRA VEZ VINO SIN BAÑARSE? MIREN SU CABELLO.

source: I showed jeongmin those messages just so she’d know one of my weaknesses?
es_419: ¿CREEN QUE LE MOSTRÉ ESOS MENSAJES A JEONGMIN PARA QUE CONOZCA UNA DE MIS DEBILIDADES?

source: did she just--
es_419: ¿ACASO…?

source: sure... something huge happened.
es_419: CLARO… PASÓ ALGO IMPORTANTE.

source: is jeongmin on drugs lately?
es_419: ¿JEONGMIN SE ESTÁ DROGANDO ÚLTIMAMENTE?

source: I’ll just stay for a second, then.
es_419: IRÉ UN PAR DE MINUTOS, ENTONCES.

source: I bet that boy chased you around constantly.
es_419: SEGURO TE PERSIGUIÓ POR TODAS PARTES.

source: why, what is it?
es_419: ¿QUÉ SUCEDE?

source: but sora also seemed to hate a lot of other people besides eunju.
es_419: PERO PARECÍA QUE ELLA TAMBIÉN ODIABA A OTRAS PERSONAS, ADEMÁS DE A EUNJU.

source: I’m going to say something,
es_419: VOY A DECIRTE ALGO,

source: I think jeongmin drove a wedge between me and sora.
es_419: CREO QUE JEONGMIN HIZO QUE SORA Y YO NOS PELEÁRAMOS.

source: do you wanna go eat tteokbokki after school, then?
es_419: ¿QUIERES IR A COMER TTEOKBOKKI DESPUÉS DE CLASES?

source: ...and the girls keep taunting and tormenting me...
es_419: … Y LAS CHICAS AÚN ME HACEN LA VIDA IMPOSIBLE…

source: I knew that by putting jeongmin with people who hate her,
es_419: SABÍA QUE, SI JUNTABA A JEONGMIN CON GENTE QUE LA ODIA,

source: I’m fine living without my friends or family...
es_419: NO TENGO PROBLEMA EN VIVIR SIN MIS AMIGAS O MI FAMILIA.

source: yeah, hahaha. what a weirdo.
es_419: SÍ. JA, JA, JA. QUÉ BICHO RARO.

source: attempted murder?
es_419: ¿INTENTO DE ASESINATO?

source: I don’t need your help anymore.
es_419: YA NO NECESITO TU AYUDA.

source: I’m sure this is what you want to believe.
es_419: SEGURO ESO ES LO QUE PREFIERES CREER…

source: why are you saying that?
es_419: ¿POR QUÉ DICES ESO?

source: I’m looking into academies.
es_419: ESTOY BUSCANDO INSTITUTOS.

source: are you really trapped in here all the time?!
es_419: ¡¿REALMENTE ESTÁS AQUÍ ATRAPADO TODO EL TIEMPO?!

source: I think juhyeon is trying to make me an outcast,
es_419: CREO QUE JUHYEON QUIERE AISLARME…

source: ...but if I don’t have jaehyeok...
es_419: PERO, SI NO TENGO A JAEHYEOK,

source: ...he always either ignores me or changes the subject.
es_419: ME IGNORA O CAMBIA DE TEMA.

source: are you okay?
es_419: ¿ESTÁS BIEN?

source: are you a robot that looks like sora?
es_419: ¿ERES UN ROBOT CON FORMA DE SORA?

source: ...doing this to me--
es_419: … ME HACE ESTO?

source: I became the villain because she wanted me to...
es_419: ME CONVERTÍ EN LA VILLANA PORQUE ELLA ME LO PIDIÓ…

source: great!
es_419: ¡GENIAL!

source: what, already?
es_419: ¿QUÉ? ¿TAN PRONTO?

source: do you have any pictures of him?
es_419: ¿TIENES FOTOS DE ÉL?

source: no way, hahaha.
es_419: INCREÍBLE. JA, JA, JA.

source: fr hahahah
es_419: SÍ JAJAJAJA

source: I stopped you because I was being a good friend, but what?
es_419: TE DETUVE PORQUE SOY BUENA AMIGA, PERO… ¿QUÉ DICES TÚ?

source: a-are you serious? no way, haha.
es_419: ¿EN SERIO? IMPOSIBLE. JA, JA.

source: wow... the weather is so nice.
es_419: VAYA… QUÉ DÍA HERMOSO.

source: that’s a relief...
es_419: QUÉ ALIVIO…

source: ...you didn’t really care!
es_419: ¡A TI NO TE IMPORTÓ!

source: juhyeon is such a saint, seriously...
es_419: JUHYEON ES UNA SANTA, EN SERIO…

source: the older girls said the gym teacher was super scary.
es_419: LAS CHICAS MÁS GRANDES ME DIJERON QUE EL PROFESOR ES TERRIBLE.

source: upset
es_419: MOLESTA

source: I wish I had a mom like that.
es_419: OJALÁ MI MAMÁ FUERA ASÍ.

source: follow
es_419: SEGUIR

source: I’ve given up on it all.
es_419: YA ME RENDÍ.

source: jeongmin, did you take sora outside just to exclude me again?
es_419: JEONGMIN, ¿TE LLEVASTE A SORA PARA EXCLUIRME DE NUEVO?

source: I’d become arrogant.
es_419: ME VOLVÍ ARROGANTE.

source: I made you play the villain?
es_419: ¿ACASO TE PEDÍ QUE FUERAS LA VILLANA?

source: ...let’s mess with her at least once.
es_419: AUNQUE SEA MOLESTÉMOSLA UN POCO.

source: don’t you feel like everything would be perfect if it wasn’t for them?
es_419: ¿NO CREES QUE TODO SERÍA PERFECTO SI NO FUERA POR ELLAS?

source: no matter how much I hate juhyeon, I can’t be on jeongmin’s side...
es_419: POR MUCHO QUE ODIE A JUHYEON, NO PUEDO UNIRME A JEONGMIN.

source: oh, I saw that.
es_419: AH, YA LO VI.

source: you’ve been quiet in the group chat lately.
es_419: NO HAS HABLADO MUCHO EN EL CHAT GRUPAL ÚLTIMAMENTE.

source: looks like you don’t recognize my face...
es_419: PARECE QUE NO RECUERDAS MI ROSTRO…

source: we weren’t hanging out without you to make you sad or feel like an outcast.
es_419: SALÍAMOS SIN TI, PERO NO PARA QUE TE SIENTAS MAL O EXCLUIDA.

source: do you think this is unfair, juhyeon?
es_419: ¿CREES QUE ES INJUSTO, JUHYEON?

source: i-is it possible that he likes boys and not girls...?
es_419: ¿SERÁ QUE LE GUSTAN LOS CHICOS Y NO LAS CHICAS?

source: you need to think rationally.
es_419: USA LA CABEZA.

source: my mom told me not to go on my computer, but I bought an hour of time!
es_419: MI MAMÁ ME DIJO QUE NO USE LA COMPUTADORA, ¡PERO COMPRÉ UNA HORA DE USO!

source: that didn’t seem right, so we brought you here to come clean and talk about it.
es_419: POR ESO TE TRAJIMOS PARA CONTARTE TODO Y HABLAR CONTIGO.

source: hyejin, look at her.
es_419: MÍRALA, HYEJIN.

source: but why jeongmin instead of yuju?
es_419: PERO… ¿POR QUÉ JEONGMIN Y NO YUJU?

source: did I do something bad enough to deserve this kind of treatment...?
es_419: ¿HICE ALGO TAN MALO QUE AHORA MEREZCO QUE ME TRATEN ASÍ…?

source: she moved here from far away,
es_419: VIENE DE MUY LEJOS,

source: but you don’t even realize your own flaws.
es_419: PERO JAMÁS VES TUS PROPIOS DEFECTOS.

source: thanks to my efforts to look good in front of juhyeon,
es_419: GRACIAS A QUE ME ESFORCÉ POR QUEDAR BIEN CON JUHYEON.

source: how pathetic.
es_419: QUÉ PATÉTICA.

source: I’m not as cool as you think...
es_419: NO SOY TAN GENIAL COMO CREES…

source: so that must be the guy that makes jeongmin’s life worth living these days.
es_419: ESE DEBE SER EL CHICO QUE HACE QUE LA VIDA DE JEONGMIN VALGA LA PENA.

source: ...when this is all she amounted to.
es_419: … ALGUIEN QUE NO VALE ABSOLUTAMENTE NADA.

source: this otherwordly place...
es_419: ESTE LUGAR MISTERIOSO…

source: I’m the class president.
es_419: SOY LA PRESIDENTA DE LA CLASE.

source: if not, I...
es_419: SI NO, YO…

source: it must have surprised you when I texted you after I kept saying I had plans.
es_419: DEBIÓ SORPRENDERTE QUE TE ESCRIBIERA LUEGO DE DECIRTE QUE TENÍA PLANES.

source: I never called him into my dream!
es_419: ¡NO LO HICE APARECER EN MI SUEÑO!

source: um... sora.
es_419: EH… SORA.

source: what? was it hard?
es_419: ¿QUÉ? ¿FUE MUY DIFÍCIL?

source: before you explain how you’re going to help me...
es_419: ANTES DE EXPLICARME CÓMO LO HARÁS…

source: poor jeongmin, hahaha.
es_419: POBRE JEONGMIN. JA, JA, JA.

source: give me your math notebook.
es_419: DAME TU CUADERNO DE MATEMÁTICA.

source: yawn
es_419: BOSTEZA

source: they’re so annoying...
es_419: SON INSOPORTABLES…

source: haven’t I been telling you to fix that?
es_419: ¿ACASO NO TE PEDÍ QUE LO CORRIGIERAS?

source: huh??
es_419: ¿EH?

source: I figured I’d understood her correctly.
es_419: SUPUSE QUE LA HABÍA ENTENDIDO BIEN.

source: what’s her problem, seriously?
es_419: ¿QUÉ PROBLEMA TIENE?

source: I’ll talk to our classmates again.
es_419: HABLARÉ CON NUESTRAS COMPAÑERAS OTRA VEZ.

source: can you still...
es_419: ¿AÚN DIRÁS…

source: I apologized to eunju. let’s go back to the classroom, it’s almost time for school to start.
es_419: LE PEDÍ DISCULPAS A EUNJU. VOLVAMOS AL SALÓN. YA CASI EMPIEZA LA CLASE.

source: honestly, I kind of figured since you stopped coming by to release your stress.
es_419: PARA SERTE SINCERO, ME LO HABÍA IMAGINADO CUANDO DEJASTE DE VENIR A LIBERAR ESTRÉS.

source: oh, right...
es_419: AH…

source: hehe, jealous?
es_419: JE, JE. ¿ESTÁS CELOSA?

source: goodbye, sir!
es_419: ¡ADIÓS, SEÑOR!

source: but juhyeon...
es_419: PERO, JUHYEON…

source: she asked if I couldn’t talk without you,
es_419: ME PREGUNTÓ SI NO PODÍA HABLAR CUANDO TÚ NO ESTÁS CONMIGO.

source: you’re pretty.
es_419: ERES BONITA.

source: even if you were hurt back then, isn’t this going too far?
es_419: AUNQUE TE SINTIERAS HERIDA POR ESO, ¿NO CREES QUE ESTO ES DEMASIADO?

source: what’s this uncomfortable feeling...?
es_419: ¿POR QUÉ ME SIENTO RARA…?

source: wow... how does he remember that?
es_419: VAYA… ¿CÓMO SE ACUERDA DE ESE MOMENTO?

source: y-you had fun talking to me?
es_419: ¿TE GUSTÓ HABLAR CONMIGO?

source: sora, what did you just say--
es_419: SORA, ¿QUÉ DIJISTE…?

source: I never called you here!
es_419: ¡YO NO TE LLAMÉ!

source: who is he?!
es_419: ¡¿QUIÉN ES?!

source: should I try again...?
es_419: ¿DEBERÍA INTENTARLO DE NUEVO…?

source: will experiencing a little bit of physical pain...
es_419: SI SUFREN UN POCO DE DOLOR FÍSICO…
